UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32l55x_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32L55x_gpio_v1_0_Modes.xml*/

#if !defined(_STM32L55x_PINMUX_H_)
# define _STM32L55x_PINMUX_H_

#define COMP1_OUT_FUNC           0
#define COMP2_OUT_FUNC           1
#define CRS_SYNC_FUNC            2
#define DEBUG_JTCK_SWCLK_FUNC    3
#define DEBUG_JTDI_FUNC          4
#define DEBUG_JTDO_SWO_FUNC      5
#define DEBUG_JTMS_SWDIO_FUNC    6
#define DEBUG_JTRST_FUNC         7
#define DEBUG_TRACECLK_FUNC      8
#define DEBUG_TRACED0_FUNC       9
#define DEBUG_TRACED1_FUNC       10
#define DEBUG_TRACED2_FUNC       11
#define DEBUG_TRACED3_FUNC       12
#define DFSDM1_CKIN0_FUNC        13
#define DFSDM1_CKIN1_FUNC        14
#define DFSDM1_CKIN2_FUNC        15
#define DFSDM1_CKIN3_FUNC        16
#define DFSDM1_CKOUT_FUNC        17
#define DFSDM1_DATIN0_FUNC       18
#define DFSDM1_DATIN1_FUNC       19
#define DFSDM1_DATIN2_FUNC       20
#define DFSDM1_DATIN3_FUNC       21
#define EVENTOUT_FUNC            22
#define FDCAN1_RX_FUNC           23
#define FDCAN1_TX_FUNC           24
#define FMC_A0_FUNC              25
#define FMC_A1_FUNC              26
#define FMC_A10_FUNC             27
#define FMC_A11_FUNC             28
#define FMC_A12_FUNC             29
#define FMC_A13_FUNC             30
#define FMC_A14_FUNC             31
#define FMC_A15_FUNC             32
#define FMC_A16_FUNC             33
#define FMC_A17_FUNC             34
#define FMC_A18_FUNC             35
#define FMC_A19_FUNC             36
#define FMC_A2_FUNC              37
#define FMC_A20_FUNC             38
#define FMC_A21_FUNC             39
#define FMC_A22_FUNC             40
#define FMC_A23_FUNC             41
#define FMC_A24_FUNC             42
#define FMC_A25_FUNC             43
#define FMC_A3_FUNC              44
#define FMC_A4_FUNC              45
#define FMC_A5_FUNC              46
#define FMC_A6_FUNC              47
#define FMC_A7_FUNC              48
#define FMC_A8_FUNC              49
#define FMC_A9_FUNC              50
#define FMC_CLK_FUNC             51
#define FMC_D0_FUNC              52
#define FMC_D1_FUNC              53
#define FMC_D10_FUNC             54
#define FMC_D11_FUNC             55
#define FMC_D12_FUNC             56
#define FMC_D13_FUNC             57
#define FMC_D14_FUNC             58
#define FMC_D15_FUNC             59
#define FMC_D2_FUNC              60
#define FMC_D3_FUNC              61
#define FMC_D4_FUNC              62
#define FMC_D5_FUNC              63
#define FMC_D6_FUNC              64
#define FMC_D7_FUNC              65
#define FMC_D8_FUNC              66
#define FMC_D9_FUNC              67
#define FMC_DA0_FUNC             68
#define FMC_DA1_FUNC             69
#define FMC_DA10_FUNC            70
#define FMC_DA11_FUNC            71
#define FMC_DA12_FUNC            72
#define FMC_DA13_FUNC            73
#define FMC_DA14_FUNC            74
#define FMC_DA15_FUNC            75
#define FMC_DA2_FUNC             76
#define FMC_DA3_FUNC             77
#define FMC_DA4_FUNC             78
#define FMC_DA5_FUNC             79
#define FMC_DA6_FUNC             80
#define FMC_DA7_FUNC             81
#define FMC_DA8_FUNC             82
#define FMC_DA9_FUNC             83
#define FMC_INT_FUNC             84
#define FMC_NBL0_FUNC            85
#define FMC_NBL1_FUNC            86
#define FMC_NCE_FUNC             87
#define FMC_NE1_FUNC             88
#define FMC_NE2_FUNC             89
#define FMC_NE3_FUNC             90
#define FMC_NE4_FUNC             91
#define FMC_NL_FUNC              92
#define FMC_NOE_FUNC             93
#define FMC_NWAIT_FUNC           94
#define FMC_NWE_FUNC             95
#define I2C1_SCL_FUNC            96
#define I2C1_SDA_FUNC            97
#define I2C1_SMBA_FUNC           98
#define I2C2_SCL_FUNC            99
#define I2C2_SDA_FUNC            100
#define I2C2_SMBA_FUNC           101
#define I2C3_SCL_FUNC            102
#define I2C3_SDA_FUNC            103
#define I2C3_SMBA_FUNC           104
#define I2C4_SCL_FUNC            105
#define I2C4_SDA_FUNC            106
#define I2C4_SMBA_FUNC           107
#define IR_OUT_FUNC              108
#define LPTIM1_ETR_FUNC          109
#define LPTIM1_IN1_FUNC          110
#define LPTIM1_IN2_FUNC          111
#define LPTIM1_OUT_FUNC          112
#define LPTIM2_ETR_FUNC          113
#define LPTIM2_IN1_FUNC          114
#define LPTIM2_OUT_FUNC          115
#define LPTIM3_ETR_FUNC          116
#define LPTIM3_IN1_FUNC          117
#define LPTIM3_OUT_FUNC          118
#define LPUART1_CTS_FUNC         119
#define LPUART1_DE_FUNC          120
#define LPUART1_RTS_FUNC         121
#define LPUART1_RX_FUNC          122
#define LPUART1_TX_FUNC          123
#define OCTOSPI1_CLK_FUNC        124
#define OCTOSPI1_DQS_FUNC        125
#define OCTOSPI1_IO0_FUNC        126
#define OCTOSPI1_IO1_FUNC        127
#define OCTOSPI1_IO2_FUNC        128
#define OCTOSPI1_IO3_FUNC        129
#define OCTOSPI1_IO4_FUNC        130
#define OCTOSPI1_IO5_FUNC        131
#define OCTOSPI1_IO6_FUNC        132
#define OCTOSPI1_IO7_FUNC        133
#define OCTOSPI1_NCLK_FUNC       134
#define OCTOSPI1_NCS_FUNC        135
#define RCC_MCO_FUNC             136
#define RTC_REFIN_FUNC           137
#define SAI1_CK1_FUNC            138
#define SAI1_CK2_FUNC            139
#define SAI1_D1_FUNC             140
#define SAI1_D2_FUNC             141
#define SAI1_D3_FUNC             142
#define SAI1_EXTCLK_FUNC         143
#define SAI1_FS_A_FUNC           144
#define SAI1_FS_B_FUNC           145
#define SAI1_MCLK_A_FUNC         146
#define SAI1_MCLK_B_FUNC         147
#define SAI1_SCK_A_FUNC          148
#define SAI1_SCK_B_FUNC          149
#define SAI1_SD_A_FUNC           150
#define SAI1_SD_B_FUNC           151
#define SAI2_EXTCLK_FUNC         152
#define SAI2_FS_A_FUNC           153
#define SAI2_FS_B_FUNC           154
#define SAI2_MCLK_A_FUNC         155
#define SAI2_MCLK_B_FUNC         156
#define SAI2_SCK_A_FUNC          157
#define SAI2_SCK_B_FUNC          158
#define SAI2_SD_A_FUNC           159
#define SAI2_SD_B_FUNC           160
#define SDMMC1_CDIR_FUNC         161
#define SDMMC1_CK_FUNC           162
#define SDMMC1_CKIN_FUNC         163
#define SDMMC1_CMD_FUNC          164
#define SDMMC1_D0_FUNC           165
#define SDMMC1_D0DIR_FUNC        166
#define SDMMC1_D1_FUNC           167
#define SDMMC1_D123DIR_FUNC      168
#define SDMMC1_D2_FUNC           169
#define SDMMC1_D3_FUNC           170
#define SDMMC1_D4_FUNC           171
#define SDMMC1_D5_FUNC           172
#define SDMMC1_D6_FUNC           173
#define SDMMC1_D7_FUNC           174
#define SPI1_MISO_FUNC           175
#define SPI1_MOSI_FUNC           176
#define SPI1_NSS_FUNC            177
#define SPI1_SCK_FUNC            178
#define SPI2_MISO_FUNC           179
#define SPI2_MOSI_FUNC           180
#define SPI2_NSS_FUNC            181
#define SPI2_SCK_FUNC            182
#define SPI3_MISO_FUNC           183
#define SPI3_MOSI_FUNC           184
#define SPI3_NSS_FUNC            185
#define SPI3_SCK_FUNC            186
#define TIM15_BKIN_FUNC          187
#define TIM15_CH1_FUNC           188
#define TIM15_CH1N_FUNC          189
#define TIM15_CH2_FUNC           190
#define TIM16_BKIN_FUNC          191
#define TIM16_CH1_FUNC           192
#define TIM16_CH1N_FUNC          193
#define TIM17_BKIN_FUNC          194
#define TIM17_CH1_FUNC           195
#define TIM17_CH1N_FUNC          196
#define TIM1_BKIN_FUNC           197
#define TIM1_BKIN2_FUNC          198
#define TIM1_CH1_FUNC            199
#define TIM1_CH1N_FUNC           200
#define TIM1_CH2_FUNC            201
#define TIM1_CH2N_FUNC           202
#define TIM1_CH3_FUNC            203
#define TIM1_CH3N_FUNC           204
#define TIM1_CH4_FUNC            205
#define TIM1_ETR_FUNC            206
#define TIM2_CH1_FUNC            207
#define TIM2_CH2_FUNC            208
#define TIM2_CH3_FUNC            209
#define TIM2_CH4_FUNC            210
#define TIM2_ETR_FUNC            211
#define TIM3_CH1_FUNC            212
#define TIM3_CH2_FUNC            213
#define TIM3_CH3_FUNC            214
#define TIM3_CH4_FUNC            215
#define TIM3_ETR_FUNC            216
#define TIM4_CH1_FUNC            217
#define TIM4_CH2_FUNC            218
#define TIM4_CH3_FUNC            219
#define TIM4_CH4_FUNC            220
#define TIM4_ETR_FUNC            221
#define TIM5_CH1_FUNC            222
#define TIM5_CH2_FUNC            223
#define TIM5_CH3_FUNC            224
#define TIM5_CH4_FUNC            225
#define TIM5_ETR_FUNC            226
#define TIM8_BKIN_FUNC           227
#define TIM8_BKIN2_FUNC          228
#define TIM8_CH1_FUNC            229
#define TIM8_CH1N_FUNC           230
#define TIM8_CH2_FUNC            231
#define TIM8_CH2N_FUNC           232
#define TIM8_CH3_FUNC            233
#define TIM8_CH3N_FUNC           234
#define TIM8_CH4_FUNC            235
#define TIM8_ETR_FUNC            236
#define TSC_G1_IO1_FUNC          237
#define TSC_G1_IO2_FUNC          238
#define TSC_G1_IO3_FUNC          239
#define TSC_G2_IO1_FUNC          240
#define TSC_G2_IO2_FUNC          241
#define TSC_G2_IO3_FUNC          242
#define TSC_G2_IO4_FUNC          243
#define TSC_G3_IO2_FUNC          244
#define TSC_G3_IO3_FUNC          245
#define TSC_G3_IO4_FUNC          246
#define TSC_G4_IO1_FUNC          247
#define TSC_G4_IO2_FUNC          248
#define TSC_G4_IO3_FUNC          249
#define TSC_G4_IO4_FUNC          250
#define TSC_G5_IO1_FUNC          251
#define TSC_G5_IO2_FUNC          252
#define TSC_G5_IO3_FUNC          253
#define TSC_G5_IO4_FUNC          254
#define TSC_G6_IO1_FUNC          255
#define TSC_G6_IO2_FUNC          256
#define TSC_G6_IO3_FUNC          257
#define TSC_G6_IO4_FUNC          258
#define TSC_G7_IO1_FUNC          259
#define TSC_G7_IO2_FUNC          260
#define TSC_G7_IO3_FUNC          261
#define TSC_G7_IO4_FUNC          262
#define TSC_G8_IO1_FUNC          263
#define TSC_G8_IO2_FUNC          264
#define TSC_G8_IO3_FUNC          265
#define TSC_G8_IO4_FUNC          266
#define TSC_SYNC_FUNC            267
#define UART4_CTS_NSS_FUNC       268
#define UART4_DE_FUNC            269
#define UART4_RTS_FUNC           270
#define UART4_RX_FUNC            271
#define UART4_TX_FUNC            272
#define UART5_CTS_NSS_FUNC       273
#define UART5_DE_FUNC            274
#define UART5_RTS_FUNC           275
#define UART5_RX_FUNC            276
#define UART5_TX_FUNC            277
#define UCPD1_FRSTX1_FUNC        278
#define UCPD1_FRSTX2_FUNC        279
#define USART1_CK_FUNC           280
#define UART1_CK_FUNC            280
#define USART1_CTS_FUNC          281
#define UART1_CTS_FUNC           281
#define USART1_DE_FUNC           282
#define UART1_DE_FUNC            282
#define USART1_NSS_FUNC          283
#define UART1_NSS_FUNC           283
#define USART1_RTS_FUNC          284
#define UART1_RTS_FUNC           284
#define USART1_RX_FUNC           285
#define UART1_RX_FUNC            285
#define USART1_TX_FUNC           286
#define UART1_TX_FUNC            286
#define USART2_CK_FUNC           287
#define UART2_CK_FUNC            287
#define USART2_CTS_FUNC          288
#define UART2_CTS_FUNC           288
#define USART2_DE_FUNC           289
#define UART2_DE_FUNC            289
#define USART2_NSS_FUNC          290
#define UART2_NSS_FUNC           290
#define USART2_RTS_FUNC          291
#define UART2_RTS_FUNC           291
#define USART2_RX_FUNC           292
#define UART2_RX_FUNC            292
#define USART2_TX_FUNC           293
#define UART2_TX_FUNC            293
#define USART3_CK_FUNC           294
#define UART3_CK_FUNC            294
#define USART3_CTS_FUNC          295
#define UART3_CTS_FUNC           295
#define USART3_DE_FUNC           296
#define UART3_DE_FUNC            296
#define USART3_NSS_FUNC          297
#define UART3_NSS_FUNC           297
#define USART3_RTS_FUNC          298
#define UART3_RTS_FUNC           298
#define USART3_RX_FUNC           299
#define UART3_RX_FUNC            299
#define USART3_TX_FUNC           300
#define UART3_TX_FUNC            300
#define USB_DM_FUNC              301
#define USB_DP_FUNC              302
#define USB_NOE_FUNC             303

